// const array = [1,2,3,4,5,6]
// // // const users = ['aa','dd','cc','bb']
// // // console.log(array[2]);
// // // console.log(users[3]);

// // //  Бул жерде биз индекс менен иштедик жана ал нерсени чыгара алдык мисалы: консольдун ичине [ачып номерин жазып чыгарып алдык]
// // // 
// // const array2 = [1, 'str', null, undefined,true, false]

// // console.log(array2);

// console.log(array.length);

// // length - бул массивдин длинасынын санын автоматтык турдо чыгарып берет.
// /// массив 



// ///цикл бул оприделонный участак кода  биз канча жолу запрос берсек ошончо жолуу чыгарып берет 

// for (let i = 0; i <= 20; i++){
//     console.log('hello'+ i);
// }

// // /// 0 равен 20ти нет ++ бул бирден кошот 20чейин  
// // for (let i = 0; i <= 20; i++){
// //     console.log('hello'+ i);
// // }

// ///задача вывести в соnsole все чотное числа от 0 до 100

// for (let i =0; i<100; i++){
//     if(i % 2 === 0)
//     console.log(i);
// }


// const numders = [ 2, 7,23, 14, 54, 26, 17, 4, 0]
// console.log(numders);

// for (let i = 0; )

// //ДЗ:
// 1. Создать массив из значений 100, 55, 15, 300, 20.
// 2. Суммировать эти значения через цикл.
// И вывести результат в консоль.

// Доп дз:
//  каждая операция сложения должна показываться в консоле.
// Например:
// [100, 55, 20];
// Вывод в консоле:
//  0 + 100 = 100; 
// 100 + 55 = 155;
//  155 + 20 = 175;

const numbers = [100, 55, 15, 300, 20];
let sum = 0;

for (let i = 0; i < numbers.length; i++) {
    console.log(`${sum} + ${numbers[i]} = ${sum + numbers[i]}`);
    sum += numbers[i];
}
console.log("Сумма значений массива:", sum);
